# ValidateConnectivity Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationUtils..::..ValidateConnectivity Method
FabricationUtils Class See Also
---
Check if two connectors are valid to connect directly without couplings.
**Namespace:** Autodesk.Revit.DB.Fabrication**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public static bool ValidateConnectivity(
	Document document,
	Connector connector1,
	Connector connector2
)
```

Visual Basic
---
```text
Public Shared Function ValidateConnectivity ( _
	document As Document, _
	connector1 As Connector, _
	connector2 As Connector _
) As Boolean
```

Visual C++
---
```text
public:
static bool ValidateConnectivity(
	Document^ document,
	Connector^ connector1,
	Connector^ connector2
)
```

# ### Parameters
document
    Type: Autodesk.Revit.DB..::..Document The document.
connector1
    Type: Autodesk.Revit.DB..::..Connector First connector to check.
connector2
    Type: Autodesk.Revit.DB..::..Connector Second connector to check against.
# ### Return Value
True if connection is valid otherwise false.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
FabricationUtils Class
Autodesk.Revit.DB.Fabrication Namespace